### Handling Missing Value # Part 2

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\Fortune_10.csv')
df

,ID,Name,COMPANIES,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","7,435,363 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$12,329,372","916,455 Dollars",3005820,7%
3,4,Mattouch,Health,2013,"$12,329,373","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","7,435,363 Dollars",8427816,23%
6,7,Cityace,IT Services,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,not available,2009,"$9,451,943","3,878,113 Dollars",3005116,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180","3,878,153 Dollars",11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

#### Checking the Null & missing values

In [5]:
df.isnull()

,ID,Name,COMPANIES,Inception,Revenue,Expenses,Profit,Growth
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False

In [10]:
#adding null values
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\Fortune_10.csv')
df

,ID,Name,COMPANIES,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,NaN,"7,435,363 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,NaN,"916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,NaN,"916,455 Dollars",3005820,NaN
3,4,Mattouch,Health,2013,NaN,"7,429,377 Dollars",6597557,\
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,]
5,6,Techline,Health,2006,"$13,898,119","7,435,363 Dollars",8427816,NaN
6,7,Cityace,IT Services,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,not available,2009,"$9,451,943","3,878,113 Dollars",3005116,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180","3,878,153 Dollars",11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [9]:
df.isnull()

,ID,Name,COMPANIES,Inception,Revenue,Expenses,Profit,Growth
0,False,False,False,False,True,False,False,False
1,False,False,False,False,True,False,False,False
2,False,False,False,False,True,False,False,True
3,False,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,True
6,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False

### Checking how many null Value in specific Column

In [11]:
df.isnull().sum()

    ID            0
Name              0
COMPANIES         0
 Inception        0
  Revenue         4
      Expenses    0
   Profit         0
  Growth          2
dtype: int64

### Total no. of null values

In [13]:
int(       df.isnull().sum().sum()            )

6

### Not Null

In [14]:
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\Fortune_10.csv')
df

,ID,Name,COMPANIES,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,NaN,"7,435,363 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,NaN,"916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,NaN,"916,455 Dollars",3005820,NaN
3,4,Mattouch,Health,2013,NaN,"7,429,377 Dollars",6597557,\
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,]
5,6,Techline,Health,2006,"$13,898,119","7,435,363 Dollars",8427816,NaN
6,7,Cityace,IT Services,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,not available,2009,"$9,451,943","3,878,113 Dollars",3005116,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180","3,878,153 Dollars",11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [16]:
# True = not null & missing values
# False = NAN
df.notnull()

,ID,Name,COMPANIES,Inception,Revenue,Expenses,Profit,Growth
0,True,True,True,True,False,True,True,True
1,True,True,True,True,False,True,True,True
2,True,True,True,True,False,True,True,False
3,True,True,True,True,False,True,True,True
4,True,True,True,True,True,True,True,True
5,True,True,True,True,True,True,True,False
6,True,True,True,True,True,True,True,True
7,True,True,True,True,True,True,True,True
8,True,True,True,True,True,True,True,True
9,True,True,True,True,True,True,True,True

### Checking how many null Value in specific Column

In [17]:
df.notnull().sum()

    ID            10
Name              10
COMPANIES         10
 Inception        10
  Revenue          6
      Expenses    10
   Profit         10
  Growth           8
dtype: int64

### Total no. of null values

In [19]:
df.notnull().sum().sum()

np.int64(74)

## Series

In [24]:
import pandas as pd
import numpy as np

sr = pd.Series([1,2,3,np.nan,4,np.nan])
sr

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
dtype: float64

### Checking Null values in Dataset

In [25]:
sr.isnull().sum()

np.int64(2)